src/cf/src/Reports/ЗарплатаСотрудника/ЗарплатаСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЗарплатаСотрудника</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>EnumRef.Месяца</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СформироватьДля</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
</mdclass:Report>

src/cf/src/InformationRegisters/ТарифныеСтавки/ТарифныеСтавки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифныеСтавки</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидПриказа</name>
    <type>
      <types>EnumRef.ВидыКадровыхПриказов</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ВариантОклада</name>
    <type>
      <types>EnumRef.ВариантыОклада</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Зарплата</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Reports/ЗарплатаСотрудника/Forms/ФормаОтчета/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.Месяц = Перечисления.Месяца.ПолучитьМесяцПоНомеру(Месяц(ТекущаяДатаСеанса()));
	Отчет.Год = Год(ТекущаяДатаСеанса());
	Отчет.СформироватьДля = ПараметрыСеанса.Пользователь.ФизическоеЛицо;
	Если Не РольДоступна(Метаданные.Роли.Администратор) и Не РольДоступна(Метаданные.Роли.Руководитель) Тогда
		Элементы.СформироватьДля.Доступность = Ложь;
	КонецЕсли;
	//Если РольДоступна(Метаданные.Роли.ДиректорПоПродажам) Тогда
	//	Элементы.Сотрудник.Доступность = Истина;
	//	Элементы.Сотрудник.РедактированиеТекста = Ложь;
	//	Элементы.Сотрудник.КнопкаВыбора = Ложь;
	//	Элементы.Сотрудник.КнопкаВыпадающегоСписка = Истина;
	//	Группа = Справочники.ФизическиеЛица.НайтиПоНаименованию("Менеджеры по продажам");
	//	Если ЗначениеЗаполнено(Группа) Тогда
	//		Выб = Справочники.Сотрудники.Выбрать(Группа);
	//		Пока Выб.Следующий() Цикл
	//			Элементы.Сотрудник.СписокВыбора.Добавить(Выб.Ссылка);		
	//		КонецЦикла;
	//	КонецЕсли;
	//	Группа = Справочники.ФизическиеЛица.НайтиПоНаименованию("Менеджеры");
	//	Если ЗначениеЗаполнено(Группа) Тогда
	//		Выб = Справочники.Сотрудники.Выбрать(Группа);
	//		Пока Выб.Следующий() Цикл
	//			Элементы.Сотрудник.СписокВыбора.Добавить(Выб.Ссылка);		
	//		КонецЦикла;
	//	КонецЕсли;
	//	Элементы.Сотрудник.СписокВыбора.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	//КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура СформироватьНаСервере()
	Отчет.ПериодРасчета = Дата(Отчет.Год, Перечисления.Месяца.ПолучитьНомерМесяцаПоНаименованию(Отчет.Месяц), 1);
	Таб.Очистить();
	Если ТипЗнч(Отчет.СформироватьДля) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		МасСотрудники = Новый Массив;
		МасСотрудники.Добавить(Отчет.СформироватьДля);
	Иначе // Подразделение (место хранения)
		МасСотрудники = РегистрыСведений.ТарифныеСтавки.ПолучитьВсехСотрудников(КонецМесяца(Отчет.ПериодРасчета), Отчет.СформироватьДля);
	КонецЕсли;
	Объект = РеквизитФормыВЗначение("Отчет");
	Макет = Объект.ПолучитьМакет("Макет");
	Валюта = Строка(Константы.ВалютаРегламентированногоУчета.Получить());
	КэшРасчета = РегистрыНакопления.Зарплата.НовыйКэшРасчетаПремий();
	Для Каждого Сотрудник Из МасСотрудники Цикл
		Структура = РегистрыНакопления.Зарплата.РассчитатьПоСотруднику(Сотрудник, Отчет.ПериодРасчета, КэшРасчета);
		ВывестиШапку(Макет, Сотрудник, Структура, Валюта);
		ВывестиНачисленияУдержания(Макет, Структура.Прочее.ТЗРасшифровка);
		ВывестиПремии(Макет, Структура.Премия.ТЗПоказатели);
		ВывестиШтрафы(Макет, Структура.Премия.ТЗШтрафы);
		Таб.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	Таб.АвтоМасштаб = Истина;
КонецПроцедуры

&НаСервере
Процедура ВывестиШапку(Макет, Сотрудник, Структура, Валюта)
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оШапка.Параметры.Сотрудник = Сотрудник;
	оШапка.Параметры.ПериодРасчета = Формат(Отчет.ПериодРасчета, "ДФ='MMMM yyyy'");
	оШапка.Параметры.ВыходовПлан = Структура.Оклад.ВыходовПланПоГрафикуПредставление;
	оШапка.Параметры.ВыходовФакт = Структура.Оклад.ВыходовФактПредставление;
	Если Структура.Оклад.ЧасовФакт = 0 Тогда
		оШапка.Параметры.Предупреждение = НСтр("ru = '; важно: табель не введён, оклад рассчитан не будет!';
			|fr = ' ; important : la feuille de temps n''est pas saisie, le salaire ne sera pas calculé !';
			|en = '; important: the timesheet is not entered, the salary will not be calculated!';
			|es = '; importante: el parte de horas no está introducido, el sueldo no se calculará.'");
	КонецЕсли;
	оШапка.Параметры.Оклад = СуммаСВалютой(Структура.Оклад.Сумма, Валюта);
	оШапка.Параметры.Премия = СуммаСВалютой(Структура.Премия.Сумма, Валюта);
	оШапка.Параметры.ПрочиеНачисления = СуммаСВалютой(Структура.Прочее.ВсегоНачислено, Валюта);
	оШапка.Параметры.ПрочиеУдержания = СуммаСВалютой(Структура.Прочее.ВсегоУдержано, Валюта);
	оШапка.Параметры.Итого = СуммаСВалютой(Структура.Итого, Валюта);
	Таб.Вывести(оШапка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СуммаСВалютой(Сумма, Валюта)
	Возврат Формат(Сумма, "ЧЦ=12; ЧДЦ=2; ЧН=") + " " + Валюта;
КонецФункции

&НаСервере
Процедура ВывестиНачисленияУдержания(Макет, ТЗРасшифровка)
	Если ТЗРасшифровка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Таб.Вывести(Макет.ПолучитьОбласть("ШапкаНачисленияУдержания"));
	оСтрока = Макет.ПолучитьОбласть("СтрокаНачисленияУдержания");
	Для Каждого Стр Из ТЗРасшифровка Цикл
		оСтрока.Параметры.СтатьяЗатрат = Стр.СтатьяЗатрат;
		оСтрока.Параметры.Сумма = ?(Стр.ВидДвижения = ВидДвиженияНакопления.Приход, 1, -1) * Стр.Сумма;
		Таб.Вывести(оСтрока);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ВывестиПремии(Макет, ТЗПоказатели)
	Если ТЗПоказатели.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Таб.Вывести(Макет.ПолучитьОбласть("ШапкаПремии"));
	оТипПоказателя = Макет.ПолучитьОбласть("ТипПоказателяПремии");
	оСтрока = Макет.ПолучитьОбласть("СтрокаПремии");
	ТЗТипыПоказателей = ТЗПоказатели.Скопировать(, "SMART");
	ТЗТипыПоказателей.Свернуть("SMART");
	ТЗТипыПоказателей.Сортировать("SMART");
	Для Каждого СтрТип Из ТЗТипыПоказателей Цикл
		Если СтрТип.SMART Тогда
			оТипПоказателя.Параметры.ТипПоказателя = НСтр("ru = 'SMART-задачи'; fr = 'Tâches SMART'; en = 'SMART tasks'; es = 'Tareas SMART'");
			Таб.Вывести(оТипПоказателя);
		КонецЕсли;
		Для Каждого Стр Из ТЗПоказатели.НайтиСтроки(Новый Структура("SMART", СтрТип.SMART)) Цикл
			оСтрока.Параметры.Заполнить(Стр);
			Таб.Вывести(оСтрока);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ВывестиШтрафы(Макет, ТЗШтрафы)
	Если ТЗШтрафы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Таб.Вывести(Макет.ПолучитьОбласть("ШапкаШтрафы"));
	оСтрока = Макет.ПолучитьОбласть("СтрокаШтрафы");
	Для Каждого Стр Из ТЗШтрафы Цикл
		оСтрока.Параметры.Заполнить(Стр);
		Таб.Вывести(оСтрока);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
